/*Ця програма потрібна для виводу назви кольору в залежності від порядкового номера кольору у спектрі(1, 2, ...7)
(червоний, помаранчевий, жовтий, зелений, блакитний, синій, фіолетовий)*/
#include <stdio.h>  // Підключаємо дуже необхідну для роботи бібліотеку вводу та виводу бо без неї нічого не працює

int main() {  // Оголошуємо головну функцію
    int color_number;  // Оголошуємо змінну для зберігання номера кольору
    printf("Введіть порядковий номер кольору у спектрі (1-7): ");  // Виводимо запит для юзера на введення номера кольору
    scanf_s("%d", &color_number);  // Зчитуємо введений номер кольору та зберігаємо його в змінну color_number

    switch (color_number) {  // Розпочинаємо оператор switch, який вибирає відповідну гілку в залежності від значення color_number
    case 1:  // Якщо color_number == 1
        printf("Червоний\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 2:  // Якщо color_number == 2
        printf("Помаранчевий\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 3:  // Якщо color_number == 3
        printf("Жовтий\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 4:  // Якщо color_number == 4
        printf("Зелений\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 5:  // Якщо color_number == 5
        printf("Блакитний\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 6:  // Якщо color_number == 6
        printf("Синій\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    case 7:  // Якщо color_number == 7
        printf("Фіолетовий\n");  // Виводимо назву кольору
        break;  // Завершуємо гілку switch
    default:  // Якщо color_number не співпадає з жодним з варіантів
        printf("Error: невірний порядковий номер кольору\n");//Виводимо помилку в разі якщо юзер натупив і тицьнув не на ту кнопку яку просили)
    }

    return 0;//Кінець програми
}
